## Lista 2 - Exercícios Pandas

_Descrição dos Exercícios:_ Serão 5 exercícios onde o objetivo será conseguir os dados de datasets conhecidos do Kaggle e responder os tópicos propostos para cada um deles.

In [1]:
# Importando o pandas
import pandas as pd

In [3]:
# Caminhos relativos dos arquivos dos datasets

# https://www.kaggle.com/datasets/dgomonov/new-york-city-airbnb-open-data
airbnb_file_path = "./datasets/AB_NYC_2019.csv"


# https://www.kaggle.com/competitions/house-prices-advanced-regression-techniques/data
house_prices_file_path = "./datasets/house_prices_train.csv"


# https://www.kaggle.com/datasets/olistbr/brazilian-ecommerce
brazilian_ecommerce_paths = {
    'orders_dataset': "./datasets/brazilian_ecommerce/olist_orders_dataset.csv",
    'items': "./datasets/brazilian_ecommerce/olist_order_items_dataset.csv",
    'products': "./datasets/brazilian_ecommerce/olist_products_dataset.csv",
}


# https://www.kaggle.com/datasets/ashutoshdevpura/imdb-top-10000-movies-updated-august-2023
imdb_movies_paths = "./datasets/movies.csv"


# https://www.kaggle.com/datasets/rush4ratio/video-game-sales-with-ratings

__Exercício 1:__ Análise de Dados do Airbnb em Nova York
__Dataset:__  Disponível no Kaggle como _New York City Airbnb Open Data_.

__Questões:__

__1-__ Exiba as primeiras 5 linhas do dataset para entender a estrutura dos dados.

__2-__ Calcule o preço médio de aluguel por bairro (neighbourhood_group).

__3-__ Encontre o número de opções de hospedagem disponíveis em cada tipo de quarto (room_type).

__4-__ Determine os 10 bairros com a maior quantidade de hospedagens listadas.

In [22]:
# importando o dataset
ds_airbnb = pd.read_csv(airbnb_file_path)


# __1-__ Exiba as primeiras 5 linhas do dataset para entender a estrutura dos dados.
(ds_airbnb.head())

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [15]:
# __2-__ Calcule o preço médio de aluguel por bairro (neighbourhood_group).
selected_columns = ['neighbourhood_group', 'price']
subset = ds_airbnb[selected_columns]
neighbourhood_groups_list = subset.groupby('neighbourhood_group').mean()
(neighbourhood_groups_list)

                          price
neighbourhood_group
Bronx                 87.496792
Brooklyn             124.383207
Manhattan            196.875814
Queens                99.517649
Staten Island        114.812332

In [16]:
# __3-__ Encontre o número de opções de hospedagem disponíveis em cada tipo de quarto (room_type).
selected_columns = ['room_type', 'id']
subset = ds_airbnb[selected_columns]
room_types = subset.groupby('room_type').count()

(room_types)

                    id
room_type
Entire home/apt  25409
Private room     22326
Shared room       1160

In [31]:
# __4-__ Determine os 10 bairros com a maior quantidade de hospedagens listadas.
selected_columns = ['neighbourhood', 'calculated_host_listings_count']
subset = ds_airbnb[selected_columns]
neighbourhoods = subset.groupby('neighbourhood').sum().sort_values(by='calculated_host_listings_count', ascending=False)
(neighbourhoods.head(10))

                    calculated_host_listings_count
neighbourhood
Financial District                           85454
Murray Hill                                  26125
Hell's Kitchen                               25169
Midtown                                      25019
Theater District                             18704
Chelsea                                      18098
Upper East Side                              16282
Upper West Side                              13360
Bedford-Stuyvesant                            9688
Tribeca                                       7606

__Exercício 2:__ Explorando Dados de Vendas de Imóveis
    
__Dataset:__ Disponível no Kaggle como _House Prices: Advanced Regression Techniques._

__Questões:__

__1-__ Exiba o número total de linhas e colunas no DataFrame.

__2-__ Encontre o preço médio dos imóveis.

__3-__ Liste as 5 áreas de lote (LotArea) mais grandes.

__4-__ Determine quantos imóveis possuem mais de 2 banheiros (FullBath).

In [27]:
# importando o dataset
ds_house_prices = pd.read_csv(house_prices_file_path)

# __1-__ Exiba o número total de linhas e colunas no DataFrame.
n_rows, n_columns = ds_house_prices.shape
print(f"{n_rows} x {n_columns}")

1460 x 81

In [29]:
# __2-__ Encontre o preço médio dos imóveis.
selected_columns = ['SalePrice']
sale_prices = ds_house_prices[selected_columns]

(sale_prices.mean())

SalePrice    180921.19589
dtype: float64

In [33]:
# __3-__ Liste as 5 maiores áreas de lote (LotArea).
selected_columns = ['LotArea']

lot_areas = ds_house_prices[selected_columns]

(lot_areas.sort_values(by='LotArea', ascending=False).head())

     LotArea
313   215245
335   164660
249   159000
706   115149
451    70761

In [53]:
# __4-__ Determine quantos imóveis possuem mais de 2 banheiros (FullBath).
selected_columns = ['FullBath']

subset = (ds_house_prices[selected_columns] > 2).sum()
(subset)

FullBath    33
dtype: int64

__Exercício 3:__ Análise de Dados de Compras Online

__Dataset:__ Disponível no Kaggle como _Brazilian E-Commerce Public Dataset by Olist._

__Questões:__

__1-__ Determine quantos pedidos foram feitos em cada ano.

__2-__ Calcule o tempo médio de entrega (diferença entre order_purchase_timestamp e order_delivered_customer_date).

__3-__ Identifique o top 5 categorias de produtos mais vendidos.

In [5]:
orders_dataset = pd.read_csv(brazilian_ecommerce_paths["orders_dataset"])

(orders_dataset.head())

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

In [8]:
# __1-__ Determine quantos pedidos foram feitos em cada ano.
orders_with_year = orders_dataset[:]

orders_with_year["order_purchase_timestamp"] = pd.to_datetime(orders_with_year["order_purchase_timestamp"])

orders_with_year["year"] = orders_with_year["order_purchase_timestamp"].dt.year
orders_by_year = orders_with_year.groupby("year").size()

(orders_by_year)

year
2016      329
2017    45101
2018    54011
dtype: int64

In [17]:
# __2-__ Calcule o tempo médio de entrega (diferença entre order_purchase_timestamp e order_delivered_customer_date).
average_delivery_dataset = orders_dataset[:]

average_delivery_dataset["order_purchase_timestamp"] = pd.to_datetime(average_delivery_dataset["order_purchase_timestamp"])
average_delivery_dataset["order_delivered_customer_date"] = pd.to_datetime(average_delivery_dataset["order_delivered_customer_date"])

average_delivery_dataset["delivery_timestamp"] = average_delivery_dataset["order_delivered_customer_date"] - average_delivery_dataset["order_purchase_timestamp"]

# (average_delivery_dataset[["delivery_timestamp", "order_purchase_timestamp", "order_delivered_customer_date"]].head(10))

average_delivery_time = average_delivery_dataset["delivery_timestamp"].mean()

print(average_delivery_time)

12 days 13:24:31.879068369

In [18]:
# __3-__ Identifique o top 5 categorias de produtos mais vendidos.
order_items_dataset = pd.read_csv(brazilian_ecommerce_paths["items"])

(order_items_dataset.head())

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [20]:
products_dataset = pd.read_csv(brazilian_ecommerce_paths["products"])

(products_dataset.head())

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

In [24]:
merge_step_1 = pd.merge(orders_dataset, order_items_dataset, on="order_id")

orders_items_products = pd.merge(merge_step_1, products_dataset, on="product_id")

(orders_items_products.head())

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date,order_item_id,product_id,...,price,freight_value,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00,1,87285b34884572647811a353c7ac498a,...,29.99,8.72,utilidades_domesticas,40.0,268.0,4.0,500.0,19.0,8.0,13.0
1,128e10d95713541c87cd1a2e48201934,a20e8105f23924cd00833fd87daa0831,delivered,2017-08-15 18:29:31,2017-08-15 20:05:16,2017-08-17 15:28:33,2017-08-18 14:44:43,2017-08-28 00:00:00,1,87285b34884572647811a353c7ac498a,...,29.99,7.78,utilidades_domesticas,40.0,268.0,4.0,500.0,19.0,8.0,13.0
2,0e7e841ddf8f8f2de2bad69267ecfbcf,26c7ac168e1433912a51b924fbd34d34,delivered,2017-08-02 18:24:47,2017-08-02 18:43:15,2017-08-04 17:35:43,2017-08-07 18:30:01,2017-08-15 00:00:00,1,87285b34884572647811a353c7ac498a,...,29.99,7.78,utilidades_domesticas,40.0,268.0,4.0,500.0,19.0,8.0,13.0
3,bfc39df4f36c3693ff3b63fcbea9e90a,53904ddbea91e1e92b2b3f1d09a7af86,delivered,2017-10-23 23:26:46,2017-10-25 02:14:11,2017-10-27 16:48:46,2017-11-07 18:04:59,2017-11-13 00:00:00,1,87285b34884572647811a353c7ac498a,...,29.99,14.10,utilidades_domesticas,40.0,268.0,4.0,500.0,19.0,8.0,13.0
4,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00,1,595fac2a385ac33a80bd5114aec74eb8,...,118.70,22.76,perfumaria,29.0,178.0,1.0,400.0,19.0,13.0,19.0

In [33]:
selected_columns = ["order_id", "product_id", "product_category_name"]

subset = orders_items_products[selected_columns]

orders_by_categories = subset.groupby("product_category_name").size().sort_values(ascending=False)

(orders_by_categories.head(5))

product_category_name
cama_mesa_banho           11115
beleza_saude               9670
esporte_lazer              8641
moveis_decoracao           8334
informatica_acessorios     7827
dtype: int64

__Exercício 4:__ Análise de Dados de Filmes do IMDb
    
__Dataset:__ Disponível no Kaggle como _IMDb movies extensive dataset_.

__Questões:__

__1-__ Exiba os títulos e anos dos 10 filmes mais recentes no dataset.

__2-__ Calcule a duração média dos filmes.

__3-__ Identifique o filme com a maior quantidade de votos (votes).

__4-__ Determine quantos filmes possuem uma classificação (avg_vote) superior a 8.

In [4]:
imdb_dataset = pd.read_csv(imdb_movies_paths)

(imdb_dataset.head())

,title,year,runtime,certificate,genre,director,stars,rating,metascore,votes,gross
0,The Shawshank Redemption,1994,142,R,Drama,"['Frank Darabont', 'Tim Robbins', 'Morgan Free...","['Tim Robbins', 'Morgan Freeman', 'Bob Gunton'...",9.3,82.0,2780534,28.34
1,The Godfather,1972,175,R,"Crime, Drama","['Francis Ford Coppola', 'Marlon Brando', 'Al ...","['Marlon Brando', 'Al Pacino', 'James Caan', '...",9.2,100.0,1935895,134.97
2,Ramayana: The Legend of Prince Rama,1993,135,PG,"Animation, Action, Adventure","['Ram Mohan', 'Yûgô Sakô', 'Koichi Saski', 'Ar...","['Yûgô Sakô', 'Koichi Saski', 'Arun Govil', 'N...",9.2,NaN,12470,NaN
3,The Chaos Class,1975,87,NaN,"Comedy, Drama","['Ertem Egilmez', 'Kemal Sunal', 'Münir Özkul'...","['Kemal Sunal', 'Münir Özkul', 'Halit Akçatepe...",9.2,NaN,42018,NaN
4,Daman,2022,121,NaN,"Adventure, Drama","['Lenka Debiprasad', 'Vishal Mourya', 'Karan K...","['Vishal Mourya', 'Karan Kandhapan', 'Babushan...",9.1,NaN,13372,NaN

In [5]:
# __1-__ Exiba os títulos e anos dos 10 filmes mais recentes no dataset.
imdb_titles_year = imdb_dataset[['title', 'year']]

imdb_titles_year.replace()

(imdb_titles_year.sort_values(by='year', ascending=False).head(10))
# Isso mostrou que alguns dos dados estão com valores que precisam ser "limpos"

            title         year
1967      Trapped  XVII) (2016
606       Charlie   VII) (2015
6460         Anna   VII) (2013
3728     The Gift    VI) (2015
5729        Smile     V) (2022
7000        Alone     V) (2020
4664         Skin     V) (2018
5017       Jackie     V) (2016
8455  The Factory     V) (2012
2391        Split    IX) (2016

In [10]:
# Limpando os dados para resolver o primeiro exercicio

# usando uma regex para extrair os valores não numérios
regex_pattern = r'(\d+)'

imdb_titles_year['year_'] = imdb_dataset['year'].str.extract(regex_pattern)[:]

(imdb_titles_year.sort_values(by='year_', ascending=False).head(10))

C:\Users\bruno\AppData\Local\Temp\ipykernel_15764\1807775049.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  imdb_titles_year['year_'] = imdb_dataset['year'].str.extract(regex_pattern)[:]

                                 title       year year_
9491                            Kabzaa       2023  2023
5407                            Hunger  II) (2023  2023
7743           Tu Jhoothi Main Makkaar       2023  2023
4116                       Flamin' Hot       2023  2023
4075                         The Flash   I) (2023  2023
8516                  Murder Mystery 2       2023  2023
7982                            Fast X       2023  2023
7346  Transformers: Rise of the Beasts       2023  2023
7983                      Cocaine Bear       2023  2023
4463                         Creed III       2023  2023

In [13]:
# __2-__ Calcule a duração média dos filmes.
average_film_runtime = imdb_dataset['runtime'].mean()

print(f"{average_film_runtime:.2f} minutos")

110.58 minutos

In [14]:
# __3-__ Identifique o filme com a maior quantidade de votos (votes).
(imdb_dataset.sort_values(by='votes', ascending=False).head(1))

,title,year,runtime,certificate,genre,director,stars,rating,metascore,votes,gross
0,The Shawshank Redemption,1994,142,R,Drama,"['Frank Darabont', 'Tim Robbins', 'Morgan Free...","['Tim Robbins', 'Morgan Freeman', 'Bob Gunton'...",9.3,82.0,2780534,28.34

In [15]:
# __4-__ Determine quantos filmes possuem uma classificação (avg_vote) superior a 8.
(imdb_dataset[imdb_dataset['rating'] > 8].shape[0])

445

__Exercício 5:__ Explorando Dados de Jogos de Videogame
    
__Dataset:__ Disponível no Kaggle como _Video Game Sales with Ratings_.
    
__Questões:__

__1-__ Liste os 5 jogos mais vendidos globalmente (Global_Sales).

__2-__ Calcule as vendas totais na América do Norte (NA_Sales).

__3-__ Encontre o jogo mais vendido no Japão (JP_Sales).

__4-__ Determine a média de pontuação dos críticos (Critic_Score) para os jogos da Nintendo.